# Intro to Pandas - Exercise

In this lesson, we have given you the starting data.  Now let's explore the UCI ML Zoo Dataset using `pandas`.

Put the [zoo.csv](zoo.csv) file in the same folder as this notebook. Then answer the following questions using code.

## Exercise Questions

1. What is the code to import our zoo dataset into a variable named `animals`?

In [1]:
import pandas as pd

animals = pd.read_csv('datasets/zoo.csv')

2. What is the type of the `animals` variable?

In [2]:
type(animals)

pandas.core.frame.DataFrame

3. How many animals are in this dataset?

In [3]:
print(animals.shape[0])

101

4. How many rows and columns are in this dataset?

In [4]:
print(f'Rows: {animals.shape[0]}\nColumns: {animals.shape[1]}')

Rows: 101
Columns: 18

5\. What are the columns of this dataset?

In [5]:
print(animals.columns.values)

['animal_name' 'hair' 'feathers' 'eggs' 'milk' 'airborne' 'aquatic'
 'predator' 'toothed' 'backbone' 'breathes' 'venomous' 'fins' 'legs'
 'tail' 'domestic' 'catsize' 'class_type']

6\. Are there any non-null observations?

In [6]:
print('Yes, most if not all of the observations are non-null.')

Yes, most if not all of the observations are non-null.

7\. How do you list the columns and their types?

In [7]:
animals.dtypes

animal_name    object
hair            int64
feathers        int64
eggs            int64
milk            int64
airborne        int64
aquatic         int64
predator        int64
toothed         int64
backbone        int64
breathes        int64
venomous        int64
fins            int64
legs            int64
tail            int64
domestic        int64
catsize         int64
class_type      int64
dtype: object

8. We want to explore animal names, legs, and catsize.Â  Filter `animals` to only use those fields.

In [8]:
filtered_animals = animals[['animal_name','legs','catsize']]
filtered_animals.shape

(101, 3)

9\. What are the first 6 rows of this dataset?

In [9]:
filtered_animals.head(6)

  animal_name  legs  catsize
0    aardvark     4        1
1    antelope     4        1
2        bass     0        0
3        bear     4        1
4        boar     4        1
5     buffalo     4        1

10\. What are the last 3 rows of this dataset?

In [10]:
filtered_animals.tail(3)

    animal_name  legs  catsize
98         wolf     4        1
99         worm     0        0
100        wren     2        0

11\. What are the values for `legs`? How many observations are there for each value?

In [11]:
filtered_animals.legs.value_counts()

4    38
2    27
0    23
6    10
8     2
5     1
Name: legs, dtype: int64

12\. Let's filter our animal set further to only include legged animals.Â  Set `animals` to this filtered set.

In [12]:
legged_only = filtered_animals[(filtered_animals.legs > 0)]
legged_only.shape

(78, 3)

13\. What is the largest amount of legs?

In [13]:
legged_only.legs.max()

8

14\. Which animals have the largest amount of legs?

In [14]:
legged_only.sort_values(by = 'legs', ascending = False).head()

   animal_name  legs  catsize
53     octopus     8        1
72    scorpion     8        0
24        flea     6        0
88     termite     6        0
30        gnat     6        0

15\. Looking at the legs, there are mostly even numbered values.Â  Which animal has 5 legs?Â  Try to guess it before writing the code.

In [15]:
legged_only[(legged_only.legs == 5)]

   animal_name  legs  catsize
85    starfish     5        0